wrk6/wrk_3003_w_10min_Heavy.txt
wrk -t 3 -c 3 -d600 -R 50 -math 1 --latency http://13.0.0.29:8081/high/web730m.html
Running 10m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.04m     2.80m    9.90m    60.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    302252.03 ms
 75.000%    430440.45 ms
 90.000%    541065.21 ms
 99.000%    594542.59 ms
 99.900%    594542.59 ms
 99.990%    594542.59 ms
 99.999%    594542.59 ms
100.000%    594542.59 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   23363.583     0.000000            1         1.00
   70451.199     0.100000            4         1.11
  120258.559     0.200000            7         1.25
  184942.591     0.300000           11         1.43
  234749.951     0.400000           14         1.67
  302252.031     0.500000           18         2.00
  336330.751     0.550000           20         2.22
  350486.527     0.600000           21         2.50
  382205.951     0.650000           23         2.86
  416284.671     0.700000           25         3.33
  455606.271     0.750000           27         4.00
  470286.335     0.775000           28         4.44
  470286.335     0.800000           28         5.00
  483393.535     0.825000           29         5.71
  498073.599     0.850000           30         6.67
  512229.375     0.875000           31         8.00
  541065.215     0.887500           32         8.89
  541065.215     0.900000           32        10.00
  541065.215     0.912500           32        11.43
  555745.279     0.925000           33        13.33
  555745.279     0.937500           33        16.00
  574095.359     0.943750           34        17.78
  574095.359     0.950000           34        20.00
  574095.359     0.956250           34        22.86
  574095.359     0.962500           34        26.67
  574095.359     0.968750           34        32.00
  594542.591     0.971875           35        35.56
  594542.591     1.000000           35          inf
#[Mean    =   302494.281, StdDeviation   =   167999.064]
#[Max     =   594018.304, Total count    =           35]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    12058.62 ms
 75.000%    16924.67 ms
 90.000%    21413.89 ms
 99.000%    27115.52 ms
 99.900%    27115.52 ms
 99.990%    27115.52 ms
 99.999%    27115.52 ms
100.000%    27115.52 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11165.695     0.000000            1         1.00
   11362.303     0.100000            4         1.11
   11411.455     0.200000            7         1.25
   11583.487     0.300000           11         1.43
   11657.215     0.400000           14         1.67
   12058.623     0.500000           18         2.00
   13484.031     0.550000           20         2.22
   14548.991     0.600000           21         2.50
   14893.055     0.650000           23         2.86
   15933.439     0.700000           25         3.33
   17481.727     0.750000           27         4.00
   18137.087     0.775000           28         4.44
   18137.087     0.800000           28         5.00
   19333.119     0.825000           29         5.71
   19513.343     0.850000           30         6.67
   20479.999     0.875000           31         8.00
   21413.887     0.887500           32         8.89
   21413.887     0.900000           32        10.00
   21413.887     0.912500           32        11.43
   23363.583     0.925000           33        13.33
   23363.583     0.937500           33        16.00
   23412.735     0.943750           34        17.78
   23412.735     0.950000           34        20.00
   23412.735     0.956250           34        22.86
   23412.735     0.962500           34        26.67
   23412.735     0.968750           34        32.00
   27115.519     0.971875           35        35.56
   27115.519     1.000000           35          inf
#[Mean    =    14727.695, StdDeviation   =     4285.983]
#[Max     =    27099.136, Total count    =           35]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35 requests in 10.03m, 25.18GB read
  Socket errors: connect 0, read 0, write 0, timeout 238
Requests/sec:      0.06
Transfer/sec:     42.84MB
Running 10m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.77m     2.78m    9.81m    57.89%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    277348.35 ms
 75.000%    416022.53 ms
 90.000%    506986.49 ms
 99.000%    589299.71 ms
 99.900%    589299.71 ms
 99.990%    589299.71 ms
 99.999%    589299.71 ms
100.000%    589299.71 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   14409.727     0.000000            1         1.00
   56950.783     0.100000            4         1.11
  111738.879     0.200000            8         1.25
  167903.231     0.300000           12         1.43
  236584.959     0.400000           16         1.67
  277348.351     0.500000           19         2.00
  304349.183     0.550000           21         2.22
  332136.447     0.600000           23         2.50
  358612.991     0.650000           25         2.86
  386400.255     0.700000           27         3.33
  416022.527     0.750000           29         4.00
  430178.303     0.775000           30         4.44
  455868.415     0.800000           31         5.00
  479199.231     0.825000           32         5.71
  493355.007     0.850000           33         6.67
  506986.495     0.875000           34         8.00
  506986.495     0.887500           34         8.89
  536346.623     0.900000           35        10.00
  536346.623     0.912500           35        11.43
  550502.399     0.925000           36        13.33
  550502.399     0.937500           36        16.00
  550502.399     0.943750           36        17.78
  576192.511     0.950000           37        20.00
  576192.511     0.956250           37        22.86
  576192.511     0.962500           37        26.67
  576192.511     0.968750           37        32.00
  576192.511     0.971875           37        35.56
  589299.711     0.975000           38        40.00
  589299.711     1.000000           38          inf
#[Mean    =   285961.917, StdDeviation   =   166673.112]
#[Max     =   588775.424, Total count    =           38]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    11542.53 ms
 75.000%    12533.76 ms
 90.000%    19464.19 ms
 99.000%    26755.07 ms
 99.900%    26755.07 ms
 99.990%    26755.07 ms
 99.999%    26755.07 ms
100.000%    26755.07 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11231.231     0.000000            1         1.00
   11288.575     0.100000            5         1.11
   11313.151     0.200000           10         1.25
   11329.535     0.300000           12         1.43
   11444.223     0.400000           16         1.67
   11542.527     0.500000           19         2.00
   11599.871     0.550000           21         2.22
   11616.255     0.600000           23         2.50
   11665.407     0.650000           25         2.86
   11730.943     0.700000           27         3.33
   12533.759     0.750000           29         4.00
   12935.167     0.775000           30         4.44
   13991.935     0.800000           31         5.00
   14401.535     0.825000           32         5.71
   16130.047     0.850000           33         6.67
   19464.191     0.875000           34         8.00
   19464.191     0.887500           34         8.89
   21659.647     0.900000           35        10.00
   21659.647     0.912500           35        11.43
   22790.143     0.925000           36        13.33
   22790.143     0.937500           36        16.00
   22790.143     0.943750           36        17.78
   23117.823     0.950000           37        20.00
   23117.823     0.956250           37        22.86
   23117.823     0.962500           37        26.67
   23117.823     0.968750           37        32.00
   23117.823     0.971875           37        35.56
   26755.071     0.975000           38        40.00
   26755.071     1.000000           38          inf
#[Mean    =    13267.267, StdDeviation   =     3914.096]
#[Max     =    26738.688, Total count    =           38]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  38 requests in 10.02m, 27.55GB read
  Socket errors: connect 0, read 0, write 0, timeout 233
Requests/sec:      0.06
Transfer/sec:     46.91MB
Running 10m test @ http://13.0.0.29:8081/high/web730m.html
  1 threads and 1 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.95m     2.84m    9.72m    57.14%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    294649.85 ms
 75.000%    434896.90 ms
 90.000%    537919.49 ms
 99.000%    583532.54 ms
 99.900%    583532.54 ms
 99.990%    583532.54 ms
 99.999%    583532.54 ms
100.000%    583532.54 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11911.167     0.000000            1         1.00
   57737.215     0.100000            4         1.11
  104792.063     0.200000            7         1.25
  190316.543     0.300000           11         1.43
  231211.007     0.400000           14         1.67
  294649.855     0.500000           18         2.00
  337117.183     0.550000           20         2.22
  351535.103     0.600000           21         2.50
  385875.967     0.650000           23         2.86
  418381.823     0.700000           25         3.33
  448266.239     0.750000           27         4.00
  462159.871     0.775000           28         4.44
  462159.871     0.800000           28         5.00
  475529.215     0.825000           29         5.71
  489422.847     0.850000           30         6.67
  503578.623     0.875000           31         8.00
  537919.487     0.887500           32         8.89
  537919.487     0.900000           32        10.00
  537919.487     0.912500           32        11.43
  552599.551     0.925000           33        13.33
  552599.551     0.937500           33        16.00
  565182.463     0.943750           34        17.78
  565182.463     0.950000           34        20.00
  565182.463     0.956250           34        22.86
  565182.463     0.962500           34        26.67
  565182.463     0.968750           34        32.00
  583532.543     0.971875           35        35.56
  583532.543     1.000000           35          inf
#[Mean    =   297240.517, StdDeviation   =   170377.768]
#[Max     =   583008.256, Total count    =           35]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    11632.64 ms
 75.000%    15245.31 ms
 90.000%    19578.88 ms
 99.000%    32636.93 ms
 99.900%    32636.93 ms
 99.990%    32636.93 ms
 99.999%    32636.93 ms
100.000%    32636.93 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   11173.887     0.000000            2         1.00
   11296.767     0.100000            4         1.11
   11370.495     0.200000            7         1.25
   11476.991     0.300000           12         1.43
   11526.143     0.400000           14         1.67
   11632.639     0.500000           18         2.00
   11771.903     0.550000           20         2.22
   11796.479     0.600000           21         2.50
   12042.239     0.650000           23         2.86
   13729.791     0.700000           25         3.33
   15417.343     0.750000           27         4.00
   17088.511     0.775000           28         4.44
   17088.511     0.800000           28         5.00
   17252.351     0.825000           29         5.71
   17743.871     0.850000           30         6.67
   18726.911     0.875000           31         8.00
   19578.879     0.887500           32         8.89
   19578.879     0.900000           32        10.00
   19578.879     0.912500           32        11.43
   27541.503     0.925000           33        13.33
   27541.503     0.937500           33        16.00
   31653.887     0.943750           34        17.78
   31653.887     0.950000           34        20.00
   31653.887     0.956250           34        22.86
   31653.887     0.962500           34        26.67
   31653.887     0.968750           34        32.00
   32636.927     0.971875           35        35.56
   32636.927     1.000000           35          inf
#[Mean    =    14423.654, StdDeviation   =     5529.753]
#[Max     =    32620.544, Total count    =           35]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35 requests in 10.01m, 25.36GB read
  Socket errors: connect 0, read 0, write 0, timeout 238
Requests/sec:      0.06
Transfer/sec:     43.23MB